<script type="text/javascript">
	const colorList = [
		'#F9F900',
		'#6FB7B7',
		'#9999CC',
		'#B766AD',
		'#B87070',
		'#FF8F59',
		'#FFAF60',
		'#FFDC35',
		'#FFFF37',
		'#B7FF4A',
		'#28FF28',
		'#1AFD9C',
		'#00FFFF',
		'#2894FF',
		'#6A6AFF',
		'#BE77FF',
		'#FF77FF',
		'#FF79BC',
		'#FF2D2D',
		'#ADADAD'
	];
	const ci = [{
			"id": 1,
			"text": "一阵狂奔，让自己在自然中挥发热与汗，一阵疾驰，让心中的愤懑放任的发泄，你可以呐喊，也可以狂吼，让心情得到舒展，让情绪得到宣泄，人的情感需要梳理，减减压，宣泄一下，也许你就会找到人生新的坐标。"
		}, {
			"id": 2,
			"text": "生活，不过就是生下来、活下去。生活就像游泳，浮沉进退都是常态。压力大了，反而重心不稳，难于进步，所以劝君减压，方得一生快乐。"
		},
		{
			"id": 3,
			"text": "生活有压力吗？不要沮丧，告诉你个减压的方法：想一件可笑的事情，使劲地想，然后呵呵的笑起来。做到了吗？哈哈，恭喜，一个傻瓜诞生了。"
		}, {
			"id": 4,
			"text": "生活真谛：一份真心诚意，二分天真纯洁，三分健康快乐，四分宽容忍让，五分和谐邻里，六分执着坚守，七分孝顺父母，八分乐观激情，九分减压放松，十分爱人爱己。愿你拥有生活真谛，享受生活幸福美丽！"
		}, {
			"id": 5,
			"text": "世界问候日，问候一下你的身体，愿你健康。问候一下你的心情，愿你快乐。问候一下你的生活，愿你活的精彩！问候一下元芳，我的心，其实你懂的！"
		}, {
			"id": 6,
			"text": "人累，心累，身体累；绝不喊累；吃苦，耐苦，生活苦；绝不喊苦；高压，低压，生活压；绝不喊压。男性保健日，为自己减压，开开心心每一天！"
		}, {
			"id": 7,
			"text": "人生就是一个方程式，生活和生命总是被忙碌换算，快乐和幸福总会得出结果，祝福和问候总是满分给你精彩。世界问候日开心！"
		}, {
			"id": 8,
			"text": "上班减压有诀窍：好好工作，不留烦恼，时常微笑，近人技巧，帮助同事，关系打牢，多送祝福，感情建好。面对竞争，公平对理，面对绯闻，只听不理。职场多变，平心静气。"
		}, {
			"id": 9,
			"text": "世界问候日，在这个特殊的节日里，一句简单的问候，传递着你我的真情与真诚的心，一切的不愉快都从这一刻化解吧，一句简单的问候将打开你我的心结。朋友不知你现在过的还好吗？"
		}, {
			"id": 10,
			"text": "熟熟的声音，很亲切；绵绵的亲情，很温暖；纯纯的情谊，很滋补；铁铁的友情，很纯真；点点的文字，很朴实；切切的问候，很贴心。朋友，世界问候日到了，愿你时刻开怀，幸福永远！"
		}, {
			"id": 11,
			"text": "问候，是心灵的热水袋，永远温暖；是情感的传话筒，永远真挚；是情谊的芬芳剂，永远清新；是友情的输送带，永远知心。世界问候日到了，就让我的问候走进你的世界，温暖你的心田，只愿你开心快乐每一天，幸福健康到永远！"
		}, {
			"id": 12,
			"text": "问候如夏花，花开绚丽，给你快乐心情，常开不败；问候如阳光，阳光灿烂，给你心灵温暖，幸福永远；问候如美酒，醇厚香浓，满载浓浓深情，情深意重。世界问候日，愿你快乐每一天，幸福到永远！"
		}, {
			"id": 13,
			"text": "问候是春花的温柔，问候是夏夜的美梦，问候是秋收的甜蜜，问候冬雪的情谊。每天都有好心情，每天都是好天气，月圆月缺都是画，花开花落都是诗。世界问候日，爱洒每一天，情暖每一天，好运永远伴随你。"
		}, {
			"id": 14,
			"text": "无论春夏秋冬，关心牵挂始终跟踪；无论白天黑夜，问候祝福永不松懈。亲爱的朋友，工作繁忙，注意休息，愿幸福快乐！"
		}, {
			"id": 15,
			"text": "笑容是对幸福的憧憬；笑容是对乐观的诠释；笑容是对心灵的减压；笑容是对精神的释放；笑容是对生活的向往；保持微笑，也许就能拥抱幸福。"
		}, {
			"id": 16,
			"text": "一分思念一弧线，穿越遥遥万里远，关心牵挂不常说，一片真情在心间。朋友，祝你拥抱安康，幸福微笑，天天快乐！"
		}, {
			"id": 17,
			"text": "距离，不=分离；没联络，不=忘记；没通电话，不=冷落；没见面，更不=没关心你。在忙碌的岁月里，让我问候你：天气忽冷忽热的，注意身体。"
		}, {
			"id": 18,
			"text": "没有压力哪有动力，压力大了哪能飞起，没有朋友哪有关怀，关怀有了减压动力，好好努力朋友挺你，酷暑难耐注意身体，调整心态，别累着自己。"
		}, {
			"id": 19,
			"text": "每天微笑多一点，每天快乐就多一点；遇到一件难事，微笑着去面对，会变得简单许多，这样也能起到有效的减压效果哦！亲爱的我们一起来为自己微笑吧！"
		}, {
			"id": 20,
			"text": "名利繁华过眼烟云飘，聚散得失匆匆身边跑，静下心来看谁始终相伴，一直不变的是家人和朋友的惦念。一声问候让一直向前奔的你，泪水潸然，朋友啊，这问候是送你永远的暖。世界问候日，祝你幸福常在，心境长安。"
		}, {
			"id": 21,
			"text": "你开心的笑，让我喜上眉梢；你伤心的哭，让我难受痛苦；你的一笑一颦，在我脑海久久回绕；你的一举一动，让我心神紧紧受控。亲爱的，在我的生命中，你最重要，愿你时时如愿，一切安好！"
		}, {
			"id": 22,
			"text": "你失落的时候，请记得你的身边有个我。你困难的时候，请记得你的身边有个我。我会帮你一起扛重担，帮你一起减压力，帮你把无助和绝望全都赶跑。因为，我是你的朋友。一起加油！"
		}, {
			"id": 23,
			"text": "你是春天里温暖的阳光，夏天里清凉的雨丝，秋天里金色的果实，冬天里浪漫的雪花，你还是我脉搏跳动的力量。你是我幸福快乐的源泉！"
		}, {
			"id": 24,
			"text": "宁可抱香枝上老，不随黄叶舞秋风！朋友，你在我心中，不是一个代名词，你是至高无上的象征，你是真诚无私的化身，你是相遇、相知、相契、相依、相助、相思、相辉、相惜后的相守。世界问候日，问候你我的朋友，愿你健康快乐。"
		}, {
			"id": 25,
			"text": "千有万有，不如身体健康拥有；千压万压，不如善于调节重压；关注男性健康，珍惜美好生活，请放松一下吧！男性健康日，愿天下所有男性劳逸结合轻松减压，健康快乐笑哈哈！"
		}, {
			"id": 26,
			"text": "亲，一毛钱的短信包含了我十分的关怀=一分按时吃饭、一分注意保暖、一分保重身体、一分加强锻炼、一分心情要灿烂、一分快乐要常伴、一分累了要休息、一分出门要安全、一分美满常左右，一分浪漫最缠绵。"
		}, {
			"id": 27,
			"text": "亲爱滴，我把关怀缝进了外套，我把体贴融进了内衣，我把祝福打进了领带，我把问候写进了短信，生活奔波多注意，事业辛苦多健体，最后想说一句话，关心照顾好自己，因为你是全家滴！"
		}, {
			"id": 28,
			"text": "让思念凝成一朵云，为你遮住骄阳；让关心化成一阵风，为你吹散烦恼；让祝福汇成一首诗，为你轻轻吟唱。"
		}, {
			"id": 29,
			"text": "一句寒暖，一份关心；一句叮咛，一份关爱；一份相思，一种情怀；一份祝福，一种情调；一声问候，一语真挚。"
		}, {
			"id": 30,
			"text": "爱人谨记：早饭一定要吃好，饿瘦了你身疼我心，出门一定要穿暖，冻坏了小手我珍惜，睡眠一定要充足，熬累娇颜我叹息，关怀一定要温馨，轻轻的问候温暖的心。"
		}, {
			"id": 31,
			"text": "朝阳初升映彩霞，暮随星月数流萤，日也盼君，夜也盼君；风掩落红埋心香，望穿天涯见浮云，坐也思君，行也思君。一曲爱歌随信去，愿君早日识相知。"
		}, {
			"id": 32,
			"text": "春花秋月何时了，往事记多少？小楼昨夜又东风，古人不堪回首思念中。情深义重应犹在，只是联系改。问君能否常微笑，恰似一江祝福将你绕。世界问候日，问候你我的朋友，愿你愉快每一天。"
		}, {
			"id": 33,
			"text": "多一点快乐，少一点烦恼！累了就睡觉，醒了就微笑！生活是什么滋味，自己放调料，收到我的信息就开心笑一笑！关心的话语"
		}, {
			"id": 34,
			"text": "风清清云淡淡，雨细细情绵绵，相识便是缘！相知就是份！让短信捎去我的祝福！让电波带去我的思念！让信息带走你的烦恼，让我祝福你！"
		}, {
			"id": 35,
			"text": "鼓励送给最看好的你，牵挂送给最惦念的你，问候送给最关心的你，祝福送给最在乎的你，祝你事事如意，时时顺利！"
		}, {
			"id": 36,
			"text": "好朋友是梦，睡也思念；好朋友是血，流淌心田；好朋友是金，沉沉甸甸；好朋友是缘，一世相牵；好朋友是路，越走越宽；好朋友是福，吉祥无边。"
		}, {
			"id": 37,
			"text": "花瓣雪飘过，把花心留给你，四季风吹过，把枫叶留给你，当月潮涌过，把欢乐留给你，夜深人静时刻，把深深的祝福留给你，天气多变，注意身体！"
		}, {
			"id": 38,
			"text": "近日高温不退，每天热的遭罪；注意珍爱自己，工作不要太累；白天多吃水果，晚上心静去睡；遇事别急上火，养心护肺宝贵；你我朋友一回，这次提醒免费！"
		}, {
			"id": 39,
			"text": "我的关心，天冷时升温；我的牵挂，风起时摇荡；我的思念，下雨时滴落；我的祝福，飘雪时飞扬！停留在有我体温的短信上，为你送去冬日暖阳！"
		}, {
			"id": 40,
			"text": "笑话是快乐的起点，假话是美丽的谎言，闲话是生活的体验，情话是爱情的贡献，无论你每天的工作压力有多大，希望都能找到快乐的根源，保持一张灿烂的笑脸！"
		}, {
			"id": 41,
			"text": "笑一笑，把烦恼清除掉；跳一跳，伸伸腿弯弯腰；忍一忍，三分饿七分饱；睡一觉，晚也好午也好；叨一叨，吐心事把心交；问一问，愿你快乐又逍遥！"
		}, {
			"id": 42,
			"text": "阳光在播撒，花儿在绽放，鸟儿在欢唱，小草在生长，生命在搏动，绿色在萌发，我在为你深深牵挂，祝福为你早早送上，愿你幸福永无边，快乐永无疆。"
		}, {
			"id": 43,
			"text": "一个不干示弱的人，总习惯雷厉风行做事，注重事物结果，却忘却了欣赏沿途风景。事实上，我们的幸福都隐藏在沿途点滴风景中！愿你那边风景--独好！"
		}, {
			"id": 44,
			"text": "让手机的振动代表我的心跳，铃声代表我的微笑，屏幕代表我的关照，信息代表我的忠告，每天为你祈祷：愿你远离烦恼，夜夜美梦围绕！"
		}, {
			"id": 45,
			"text": "人生就是一场戏，得失成败由他去。没事不要生闲气，气出病来无人替。保持一个好身体，健康财富一大笔。心情愉快添福气，开心快乐最无敌！"
		}, {
			"id": 46,
			"text": "半贫半富半足安，半智半愚半圣贤。半有半无半苦乐，半醒半梦半神仙。一个“半”字，恰好找到世间万物的“度”。世间哪有十全事，愿你人生完美只求半。"
		}, {
			"id": 47,
			"text": "如果有钱是痛，愿你一痛再痛；如果成功是蠢，愿你一蠢再蠢；如果花前月下也是苦，愿你有吃不尽的苦；如果身体健康也是错，愿你一生都犯错。"
		}, {
			"id": 48,
			"text": "人生虽短，情却可以永远；身虽相隔，心却可以无间。蓦然回首，岁月如流，一声祝福，真心依旧，好久不见，最近怎样？愿快乐伴你每一天。"
		}, {
			"id": 49,
			"text": "轻轻地，我的短信来了，出现在你的手机，你的世界；慢慢地，你睁开眼，看到我的关怀，我的问候；悄悄地，你笑了，笑得那么甜！祝你开心每一天！"
		}, {
			"id": 50,
			"text": "轻轻的问候，深深的祝福，丝丝的情谊，串串的思念，化作殷殷的祝福，留在你的心田间，给你带来友谊的温馨，祝愿你事事如愿，天天开心！"
		}, {
			"id": 51,
			"text": "没有风，也摇摆；没有云，也自在；没有天，也呼唤；没有山，也攀岩！真正的快乐，在自己，别人不能给；真正的幸福，靠自己，别人不会阻拦。更应常常仰望天父，因为他是造物主。"
		}, {
			"id": 52,
			"text": "累了，请将心靠岸；错了，别想到后悔；苦了，才懂得满足；伤了，才明白坚强；醉了，才知道难忘；笑了，才体会美丽；闷了，就找我聊聊！"
		}, {
			"id": 53,
			"text": "累了，就要多休息；困了，就要入梦里；饿了，就要吃东西；烦了，就要解闷气；乐了，就要笑嘻嘻；想了，就要多联系。常给我发短信息，包你快乐又美丽。"
		}, {
			"id": 54,
			"text": "将生活细细打点，让快乐来将生活装点，抓住幸福的重点，手里的钱儿多攒点，烦恼不见丁点，爱情来得就是正点，你是家里重要的支点，祝你快乐再多一点！"
		}, {
			"id": 55,
			"text": "愿你忘却工作的劳累，用鱼翅燕窝养养胃，用清新空气洗洗肺，让灿烂的阳光搓搓背，找群朋友喝个小醉，再用小猫的感觉睡上一睡，愿你心情爽脆！"
		}, {
			"id": 56,
			"text": "一声真挚的问候，一片深切的思念，一份美好的祝福，送给关心我和我关心的你，祝你永远开心快乐！"
		}, {
			"id": 57,
			"text": "送你一枚定心丸，配料就是“八心”：待人要诚心，做事要用心，生活有爱心，朋友要知心，烦躁须静心，遇事放宽心，美好多留心，时时都开心！"
		}, {
			"id": 58,
			"text": "时间是链子，快乐是珠子，用链子串珠子挂在胸前就可以幸福一辈子；幸福是石子，时间是筛子，用筛子筛掉小沙子，石子就会陪你一辈子。"
		}, {
			"id": 59,
			"text": "生活的乐趣，就是站在窗前，看着花草淋着雨；无聊时，总会有点小惊喜；聚会，酒酣耳热吼歌曲；面对爱人，偶尔来点小亲昵；打开手机，收到我的短信息。"
		}, {
			"id": 60,
			"text": "工作堆积如山，山不倒；时间流逝如水，水不断。工作抓紧时间，高效率；下班留出时间，享生活！善待自己，宽容别人。"
		}, {
			"id": 61,
			"text": "大音希声，只有默默的关怀。大象无形，只有持久的关注。大爱无言，只有淡淡的思念。真水无香，只有深深的惦记。走过岁月，心中依然珍藏一份感动。"
		}, {
			"id": 62,
			"text": "车如潮，人如海，上班一族排成排。朝九点，晚五点，两点一线赶时间。工作忙，职场累，拼搏事业很疲惫。上班族，工薪族，平平安安就是福。"
		}, {
			"id": 63,
			"text": "不要攀，不要比，不要自己气自己。少吃盐，多吃醋，少斗地主多散步。早点睡，按时起，跑步跳操好身体。轻松活，好好过，一天更比一天乐！"
		}, {
			"id": 64,
			"text": "在匆忙中经过了多少故事，沧桑的心底有多少抹不尽的记忆，真切的未来会告诉你更多的真实，让曾经的故事风淡云轻，面对现实，好好把握生活！"
		}, {
			"id": 65,
			"text": "摘不到的星星总是最闪亮的，溜掉的小鱼总是最可爱的，错过的电影总是最好看的，失去的情人总是最深爱的，而正在看短信的朋友总是我最珍惜的！"
		}, {
			"id": 66,
			"text": "阵阵秋雨阵阵寒，柔柔轻风吹面冷！秋高气爽登高处，遍地菊花黄灿灿！秋又到，天气冷，朋友记得多添衣多盖被，冷冷清秋，心里温暖！秋天快乐！"
		}, {
			"id": 67,
			"text": "最近是否开心，生活是否顺心，饭菜是否会心，小窝是否暖心，朋友是否知心，爱人是否真心，如果一切顺心，举手画颗爱心，化作天际恒心！"
		}
	]
	const billtype = [{
		value: '1',
		text: '支出',
		children: [{
				value: "3",
				text: "吃饭"
			},
			{
				value: "4",
				text: "车票"
			},
			{
				value: "5",
				text: "家里"
			},{
				value: "6",
				text: "衣服"
			},
			{
				value: "7",
				text: "房租网费"
			},
			{
				value: "8",
				text: "零食"
			},{
				value: "9",
				text: "淘宝"
			},{
				value: "10",
				text: "公交卡"
			},
			{
				value: "11",
				text: "话费"
			},{
				value: "12",
				text: "超市"
			},
		]
	}, {
		value: '2',
		text: '收入',
		children: [{
			value: "13",
			text: "工资"
		}]
	}];
	const colorListLength = 20;
	const isDev = true;
	const requestDevServerPath = "http://bill.bjwcom.cn:8002/api";
	const requestReleaseServerPath = "http://bill.bjwcom.cn:8001/api";

	const requestDownLoadServerPath = "http://bill.bjwcom.cn/" + (isDev ? "testapp" : "app");
	const requestServerPath = isDev ? requestDevServerPath : requestReleaseServerPath;
	const baiduMapKey = "MzriWVdMO3LYa9Pd4jxwXfVg";
	const btnArray = ['否', '是'];
	const dsapiPath = "http://open.iciba.com/dsapi";

	function getDate() {
		const date = new Date();
		const currdate = date.getFullYear() + "-" + ("0" + (date.getMonth() + 1)).slice(-2) + "-" + ("0" + (date.getDate())).slice(-2);
		return currdate;
	}

	function getRandColor() {
		var tem = Math.round(Math.random() * colorListLength)
		return colorList[tem]
	}

	export default {
		colorList,
		colorListLength,
		getRandColor,
		requestServerPath,
		requestDownLoadServerPath,
		btnArray,
		baiduMapKey,
		dsapiPath,
		getDate,
		ci,
		billtype,
	}
</script>

作者：程序仲小仲 链接：https://www.jianshu.com/p/7547ff8760c3 來源：简书 简书著作权归作者所有，任何形式的转载都请联系作者获得授权并注明出处。